app/controllers/admin/reviews_controller.rb

  def load_categories
    @categories = Category.all
---
SELECT `categories`.* FROM `categories`