app/controllers/admin/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 33 LIMIT 1
UPDATE `users` SET `external_user_id` = 644106691, `address` = '', `provider` = '', `updated_at` = '2013-03-11 19:31:59' WHERE `users`.`id` = 33
---
  def update
    password_presence
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])