app/controllers/search_controller.rb

SELECT `categories`.* FROM `categories`
---
  def load_data_for_checkbox
    categories = Category.fetch_all.map{|c| [c.name, "category_#{c.id}"] }