app/controllers/users_controller.rb

  def address_toggle
    @user.update_attributes(:address_visible => params[:value]) if @user == current_user
---
UPDATE `users` SET `updated_at` = '2013-02-27 00:33:27', `address_visible` = 1 WHERE `users`.`id` = 9

    def find_user
      @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (external_user_id IN (NULL) OR id IN (NULL))

def load_data_for_checkbox
    categories = Category.fetch_all.map{|c| [c.name, "category_#{c.id}"] }
---
SELECT `categories`.* FROM `categories`