app/views/reviews/index.html.erb

SELECT `categories`.id FROM `categories` INNER JOIN `category_reviews` ON `categories`.`id` = `category_reviews`.`category_id` WHERE `category_reviews`.`review_id` IS NULL
---
          <div class="inputs">
            <%= f.input :category_ids, :collection => Category.all, :as => :chosen, :prompt => false,
                             :input_html => {  :multiple => true },
                             :label => I18n.t('write_review.categories_selector_label') , :placeholder => I18n.t('write_review.categories_selector_placeholder') %>